In [402]:
%run load_pga_tee_time.py
df_tee_time = df

   Group Number            Tee Time  Start Tee  Group Location  Group Hole  \
0             1 2025-03-27 12:25:00          1  Round Complete          18
1             1 2025-03-27 12:25:00          1  Round Complete          18

                 Course Name Group Status        Player Name Country
0  Memorial Park Golf Course     COMPLETE        Joel Dahmen     USA
1  Memorial Park Golf Course     COMPLETE  Taylor Montgomery     USA

In [347]:
import pandas as pd

# User input for the date
# Need try catch if date is old tournament.
date_input = '2025-03-29'

# Convert user input to a pandas Timestamp
date_input = pd.to_datetime(date_input)

# Filter the DataFrame to include only rows with the specified date
df_tee_time = df_tee_time[df_tee_time['Tee Time'].dt.date == date_input.date()]

print(df_tee_time)

     Group Number            Tee Time  Start Tee  Group Location  Group Hole  \
305             1 2025-03-29 15:00:00          1  Round Complete           1
306             1 2025-03-29 15:00:00          1  Round Complete           1
307             1 2025-03-29 15:00:00          1  Round Complete           1
308            13 2025-03-29 15:00:00         10  Round Complete          10
309            13 2025-03-29 15:00:00         10  Round Complete          10
..            ...                 ...        ...             ...         ...
369            23 2025-03-29 16:50:00         10       8 Fairway           8
370            23 2025-03-29 16:50:00         10       8 Fairway           8
371            12 2025-03-29 17:01:00          1      17 Fairway          17
372            12 2025-03-29 17:01:00          1      17 Fairway          17
373            12 2025-03-29 17:01:00          1      17 Fairway          17

                   Course Name Group Status        Player Name Country
305  Memorial Park Golf Course     COMPLETE       Nate Lashley     USA
306  Memorial Park Golf Course     COMPLETE     Davis Thompson     USA
307  Memorial Park Golf Course     COMPLETE       Thomas Detry     BEL
308  Memorial Park Golf Course     COMPLETE          Jason Day     AUS
309  Memorial Park Golf Course     COMPLETE       Matt McCarty     USA
..                         ...          ...                ...     ...
369  Memorial Park Golf Course       ACTIVE     Philip Knowles     USA
370  Memorial Park Golf Course       ACTIVE        Trevor Cone     USA
371  Memorial Park Golf Course       ACTIVE  Scottie Scheffler     USA
372  Memorial Park Golf Course       ACTIVE    Taylor Pendrith     CAN
373  Memorial Park Golf Course       ACTIVE        Min Woo Lee     AUS

[69 rows x 9 columns]

In [348]:
%run load_pga_tournament.py
df_tournament = df

  POS    PLAYER  TOT THRU  R1    R2    R3 R4  total_stroke
0   1    M. Lee  -17   16  66  64.0     -  -           130
1   2  A. Tosti  -13    F  65  67.0  65.0  -           197

C:\Users\rypi3\source\repos\data_golf\load_pga_tournament.py:40: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '-' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.fillna('-', inplace=True)

In [349]:
%run load_pga_fedexcup_rank.py
df_rank = df

    Player Name           Country Projected Rank Official Rank  \
0  Rory McIlroy  Northern Ireland              1             1
1   Sepp Straka           Austria              2             2

  Point Data Projected Point Data Official
0            1,636.386               1,586
1            1,308.408               1,308

In [350]:
%run load_world_rank.py
df_world_rank = df

   Rank          Full Name First Name   Last Name           Birth Date  \
0     1  Scottie Scheffler    Scottie   Scheffler  1996-06-21T00:00:00
1     2       Rory McIlroy       Rory     McIlroy  1989-05-04T00:00:00
2     3  Xander Schauffele     Xander  Schauffele  1993-10-25T00:00:00
3     4    Collin Morikawa     Collin    Morikawa  1997-02-06T00:00:00
4     5       Ludvig Aberg     Ludvig       Aberg  1999-10-31T00:00:00

            Country  Points Lost  Points Won  Points Total  Points Average  \
0     United States  -143.037725   45.275738    557.437930         13.9359
1  Northern Ireland   -81.653463  177.833733    456.877455          9.9321
2     United States   -81.722227    9.283586    324.335945          8.1084
3     United States   -49.110864   89.884339    278.954405          6.6418
4            Sweden   -42.514840   82.331223    252.506714          6.0121

   Last Week Rank  End Last Year Rank  Week End Date
0               1                   1  23 March 2025
1               2                   3  23 March 2025
2               3                   2  23 March 2025
3               4                   4  23 March 2025
4               5                   5  23 March 2025

In [351]:
df_world_rank = df_world_rank[df_world_rank['Rank'] <= 1000]

In [352]:
df_world_rank[df_world_rank['Full Name'] == 'Rasmus Hojgaard']

,Rank,Full Name,First Name,Last Name,Birth Date,Country,Points Lost,Points Won,Points Total,Points Average,Last Week Rank,End Last Year Rank,Week End Date
56,57,Rasmus Hojgaard,Rasmus,Hojgaard,2001-03-12T00:00:00,Denmark,-17.987907,13.603053,99.935602,1.9218,53,37,23 March 2025

In [353]:
def extract_name_with_initial(full_name):
    name_parts = full_name.split()
    first_initial = name_parts[0][0] + '.' if name_parts else ''
    last_name = name_parts[-1] if len(name_parts) > 1 else ''
    return f"{first_initial} {last_name}"

In [354]:
# Apply the function to the Full Name column to create a new Last Name column
df_tournament['Name_Key2'] = df_tournament['PLAYER'].apply(extract_name_with_initial)
df_tee_time['Name_Key2'] = df_tee_time['Player Name'].apply(extract_name_with_initial)
df_rank['Name_Key2'] = df_rank['Player Name'].apply(extract_name_with_initial)
df_world_rank['Name_Key2'] = df_world_rank['Full Name'].apply(extract_name_with_initial)

C:\Users\rypi3\AppData\Local\Temp\ipykernel_25560\2081487957.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_tee_time['Name_Key2'] = df_tee_time['Player Name'].apply(extract_name_with_initial)
C:\Users\rypi3\AppData\Local\Temp\ipykernel_25560\2081487957.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_world_rank['Name_Key2'] = df_world_rank['Full Name'].apply(extract_name_with_initial)

In [355]:
df_tee_time.tail(2)

,Group Number,Tee Time,Start Tee,Group Location,Group Hole,Course Name,Group Status,Player Name,Country,Name_Key2
372,12,2025-03-29 17:01:00,1,17 Fairway,17,Memorial Park Golf Course,ACTIVE,Taylor Pendrith,CAN,T. Pendrith
373,12,2025-03-29 17:01:00,1,17 Fairway,17,Memorial Park Golf Course,ACTIVE,Min Woo Lee,AUS,M. Lee

In [375]:
#df_times_rank = pd.merge(df_tee_time, df_tournament, on='Name_Key2', how='left')
#df_times_rank = pd.merge(df_times_rank, df_rank, on='Name_Key2', how='left')
df_times_rank = pd.merge(df_tee_time, df_world_rank, left_on='Player Name', right_on='Full Name', how='left')

In [376]:
df_times_rank.sort_values(by='Rank', ascending=False)

,Group Number,Tee Time,Start Tee,Group Location,Group Hole,Course Name,Group Status,Player Name,Country_x,Name_Key2_x,...,Birth Date,Country_y,Points Lost,Points Won,Points Total,Points Average,Last Week Rank,End Last Year Rank,Week End Date,Name_Key2_y
64,23,2025-03-29 16:50:00,10,8 Fairway,8,Memorial Park Golf Course,ACTIVE,Philip Knowles,USA,P. Knowles,...,1996-10-16T00:00:00,United States,-1.073816,1.401632,7.120565,0.1780,612.0,655.0,23 March 2025,P. Knowles
44,8,2025-03-29 16:17:00,1,Round Complete,1,Memorial Park Golf Course,COMPLETE,Matthew Riedel,USA,M. Riedel,...,2000-10-26T00:00:00,United States,-1.226621,2.636532,9.661706,0.2415,494.0,577.0,23 March 2025,M. Riedel
65,23,2025-03-29 16:50:00,10,8 Fairway,8,Memorial Park Golf Course,ACTIVE,Trevor Cone,USA,T. Cone,...,1992-11-13T00:00:00,United States,-4.023501,0.384286,15.387304,0.3140,389.0,349.0,23 March 2025,T. Cone
62,11,2025-03-29 16:50:00,1,18 Fairway,18,Memorial Park Golf Course,ACTIVE,Trey Mullinax,USA,T. Mullinax,...,1992-06-29T00:00:00,United States,-2.295891,8.769678,13.039227,0.3260,385.0,669.0,23 March 2025,T. Mullinax
6,2,2025-03-29 15:11:00,1,Round Complete,1,Memorial Park Golf Course,COMPLETE,Mason Andersen,USA,M. Andersen,...,1998-11-23T00:00:00,United States,-5.436352,1.906716,18.090707,0.3479,367.0,314.0,23 March 2025,M. Andersen
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18,4,2025-03-29 15:33:00,1,Round Complete,1,Memorial Park Golf Course,COMPLETE,Mac Meissner,USA,M. Meissner,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
36,7,2025-03-29 16:06:00,1,Round Complete,1,Memorial Park Golf Course,COMPLETE,Kevin Yu,TPE,K. Yu,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
45,20,2025-03-29 16:17:00,10,Round Complete,10,Memorial Park Golf Course,COMPLETE,Charles Reiter,USA,C. Reiter,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
48,9,2025-03-29 16:28:00,1,Round Complete,1,Memorial Park Golf Course,COMPLETE,Rasmus Højgaard,DEN,R. Højgaard,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
54,10,2025-03-29 16:39:00,1,Round Complete,1,Memorial Park Golf Course,COMPLETE,Nico Echavarria,COL,N. Echavarria,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [378]:
print(df_rank.shape[1] + df_tee_time.shape[1] + df_tournament.shape[1])

27

In [379]:
df_times_rank.columns

Index(['Group Number', 'Tee Time', 'Start Tee', 'Group Location', 'Group Hole',
       'Course Name', 'Group Status', 'Player Name', 'Country_x',
       'Name_Key2_x', 'Rank', 'Full Name', 'First Name', 'Last Name',
       'Birth Date', 'Country_y', 'Points Lost', 'Points Won', 'Points Total',
       'Points Average', 'Last Week Rank', 'End Last Year Rank',
       'Week End Date', 'Name_Key2_y'],
      dtype='object')

In [383]:
df_times_rank = df_times_rank[['Group Number','Tee Time', 'Player Name'
                               #,'Official Rank'
                               ,'Rank']]

In [384]:
# Convert numeric columns to integer
# Replace '-', remove 'T', handle NaN values, and safely convert to integers
#df_times_rank['Official Rank'] = (
#    df_times_rank['Official Rank']
#    .replace('-', 1000)               # Replace '-' with 1000
#    .astype(str)                      # Convert the column to string
#    .str.replace('T', '', regex=False)  # Remove 'T' (regex=False makes it explicit)
#    .replace('nan', 1000)             # Handle 'nan' represented as a string
#    .fillna(1000)                     # Handle actual NaN values
#    .astype(float)                    # Convert to float first
#    .astype(int)                      # Finally, convert to integer
#)

In [385]:
# Convert numeric columns to integer
# Replace '-', remove 'T', handle NaN values, and safely convert to integers
#df_times_rank['Rank'] = (
#    df_times_rank['Rank']
#    .str.replace('T', '', regex=False)  # Remove 'T' (regex=False makes it explicit)
#    .replace('-', 9999)               # Replace '-' with 1000
 #   .astype(str)                      # Convert the column to string
 #   .replace('nan', 9999)             # Handle 'nan' represented as a string
 #   .fillna(9999)                     # Handle actual NaN values
 #   .astype(float)                    # Convert to float first
 #   .astype(int)                      # Finally, convert to integer
#)

In [386]:
df_times_rank.count()
df_times_rank.sort_values(by='Rank', ascending=False)

    Group Number            Tee Time      Player Name   Rank
64            23 2025-03-29 16:50:00   Philip Knowles  615.0
44             8 2025-03-29 16:17:00   Matthew Riedel  497.0
65            23 2025-03-29 16:50:00      Trevor Cone  396.0
62            11 2025-03-29 16:50:00    Trey Mullinax  384.0
6              2 2025-03-29 15:11:00   Mason Andersen  368.0
..           ...                 ...              ...    ...
18             4 2025-03-29 15:33:00     Mac Meissner    NaN
36             7 2025-03-29 16:06:00         Kevin Yu    NaN
45            20 2025-03-29 16:17:00   Charles Reiter    NaN
48             9 2025-03-29 16:28:00  Rasmus Højgaard    NaN
54            10 2025-03-29 16:39:00  Nico Echavarria    NaN

[69 rows x 4 columns]

In [387]:
df_times_rank.dtypes

Group Number             int64
Tee Time        datetime64[ns]
Player Name             object
Rank                   float64
dtype: object

In [388]:
# Group by the key and calculate the difference between rows
# Calculate the maximum value for each 'Group Number' group
max_values = df_times_rank.groupby('Group Number')['Rank'].transform('min')

# Calculate the difference between the maximum and each value
df_times_rank['Difference'] = max_values - df_times_rank['Rank']

In [389]:
print(f'original row count: {df_times_rank.shape[0]}')

original row count: 69

In [390]:
# Remove duplicates from upcoming tee times
df_times_rank.drop_duplicates(inplace=True)

In [391]:
print(f'original row count: {df_times_rank.shape[0]}')

original row count: 69

In [392]:
df_best_groups = df_times_rank[df_times_rank['Difference']<0]
df_best_groups.head()

   Group Number            Tee Time     Player Name   Rank  Difference
0             1 2025-03-29 15:00:00    Nate Lashley  235.0      -209.0
1             1 2025-03-29 15:00:00  Davis Thompson   43.0       -17.0
4            13 2025-03-29 15:00:00    Matt McCarty   56.0       -21.0
6             2 2025-03-29 15:11:00  Mason Andersen  368.0      -179.0
8             2 2025-03-29 15:11:00      Chad Ramey  310.0      -121.0

In [393]:
# Filter rows in df_other based on Group Numbers in df_best_groups
df_bet = df_times_rank[df_times_rank['Group Number'].isin(df_best_groups['Group Number'])]

df_bet.head(5)

   Group Number            Tee Time     Player Name   Rank  Difference
0             1 2025-03-29 15:00:00    Nate Lashley  235.0      -209.0
1             1 2025-03-29 15:00:00  Davis Thompson   43.0       -17.0
2             1 2025-03-29 15:00:00    Thomas Detry   26.0         0.0
3            13 2025-03-29 15:00:00       Jason Day   35.0         0.0
4            13 2025-03-29 15:00:00    Matt McCarty   56.0       -21.0

In [397]:
# Compute the mean for each group and assign it as a new column
df_bet['Sum'] = df_bet.groupby('Group Number')['Difference'].transform('sum')
df_bet['Average'] = df_bet.groupby('Group Number')['Difference'].transform('mean')

In [398]:
df_bet.sort_values(by='Sum', ascending=True).head(n=10)

,Group Number,Tee Time,Player Name,Rank,Difference,Sum,Average
63,23,2025-03-29 16:50:00,Chris Gotterup,228.0,0.0,-555.0,-185.0
64,23,2025-03-29 16:50:00,Philip Knowles,615.0,-387.0,-555.0,-185.0
65,23,2025-03-29 16:50:00,Trevor Cone,396.0,-168.0,-555.0,-185.0
44,8,2025-03-29 16:17:00,Matthew Riedel,497.0,-398.0,-408.0,-136.0
42,8,2025-03-29 16:17:00,Kurt Kitayama,99.0,0.0,-408.0,-136.0
43,8,2025-03-29 16:17:00,Ryan Fox,109.0,-10.0,-408.0,-136.0
6,2,2025-03-29 15:11:00,Mason Andersen,368.0,-179.0,-300.0,-100.0
7,2,2025-03-29 15:11:00,William Mouw,189.0,0.0,-300.0,-100.0
8,2,2025-03-29 15:11:00,Chad Ramey,310.0,-121.0,-300.0,-100.0
24,5,2025-03-29 15:44:00,Michael Kim,52.0,0.0,-297.0,-99.0

In [400]:
df_bet.sort_values(by='Average', ascending=True).head(n=10)

,Group Number,Tee Time,Player Name,Rank,Difference,Sum,Average
63,23,2025-03-29 16:50:00,Chris Gotterup,228.0,0.0,-555.0,-185.0
64,23,2025-03-29 16:50:00,Philip Knowles,615.0,-387.0,-555.0,-185.0
65,23,2025-03-29 16:50:00,Trevor Cone,396.0,-168.0,-555.0,-185.0
44,8,2025-03-29 16:17:00,Matthew Riedel,497.0,-398.0,-408.0,-136.0
42,8,2025-03-29 16:17:00,Kurt Kitayama,99.0,0.0,-408.0,-136.0
43,8,2025-03-29 16:17:00,Ryan Fox,109.0,-10.0,-408.0,-136.0
6,2,2025-03-29 15:11:00,Mason Andersen,368.0,-179.0,-300.0,-100.0
7,2,2025-03-29 15:11:00,William Mouw,189.0,0.0,-300.0,-100.0
8,2,2025-03-29 15:11:00,Chad Ramey,310.0,-121.0,-300.0,-100.0
24,5,2025-03-29 15:44:00,Michael Kim,52.0,0.0,-297.0,-99.0

In [399]:
import tabulate

ModuleNotFoundError: No module named 'tabulate'